{
  "backend/main.mo": "Empty Motoko actor with no backend logic.",
  "feature_evidence.json": "Report describing a feature for replacing static site images with user-uploaded ones; contains metadata only.",
  "frontend-file-summaries.txt": "Text file mapping frontend source paths to short summaries for reference.",
  "frontend/index.css": "Tailwind base file defining color variables for light and dark themes and applying global styles.",
  "frontend/index.html": "Base HTML document loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React app composing all site sections within the layout.",
  "frontend/src/components/ContactSection.tsx": "Renders Discord link and community info with icons and styled cards.",
  "frontend/src/components/FeaturesSection.tsx": "Displays feature cards using icons and data from siteConfig.",
  "frontend/src/components/Footer.tsx": "Footer showing server info, quick links, and a caffeine.ai credit link.",
  "frontend/src/components/HeroSection.tsx": "Hero banner with background image, logo, server name, and join button.",
  "frontend/src/components/HowToJoinSection.tsx": "Shows steps for joining the server and provides a copy-to-clipboard server address box.",
  "frontend/src/components/RulesSection.tsx": "Lists server rules with numbered cards and an important notice box.",
  "frontend/src/components/SiteLayout.tsx": "Page layout wrapper containing navigation, main content area, and footer.",
  "frontend/src/components/SiteNav.tsx": "Responsive site navigation component with smooth section scrolling and mobile menu toggle.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity and refreshes queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handles login/logout, identity loading, and auth client setup.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder module exporting nothing because backend has no methods.",
  "frontend/src/index.css": "Tailwind base styles plus custom light/dark OKLCH color variables inspired by Minecraft aesthetics.",
  "frontend/src/main.tsx": "App entry point initializing React, query client, Internet Identity provider, and global styles.",
  "frontend/src/siteConfig.ts": "Static configuration for server metadata, rules, and feature descriptions used across the site.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, fonts, animations, and enabling plugins like typography and container queries.",
  "project_state.json": "Project metadata describing current site purpose, features, issues, and required assets for Cooper SMP."
}